{"command.restartServer":"Server neu starten","extension.description":"Linten-Support für Python-Dateien, die „flake8“ verwenden.","settings.args.description":"Übergebene Argumente. Jedes Argument ist eine separate Zeichenfolge im Array.","settings.importStrategy.description":"Definiert, woher „flake8“ importiert wird. Diese Einstellung wird möglicherweise ignoriert, wenn „flake8.path“ festgelegt ist.","settings.importStrategy.fromEnvironment.description":"Verwenden Sie „flake8“ aus der Umgebung, und verwenden Sie nur dann ein Fallback auf eine gebündelte Version, wenn „flake8““ in der Umgebung nicht verfügbar ist.","settings.importStrategy.useBundled.description":"Verwenden Sie immer die gebündelte Version von „flake8“","settings.interpreter.description":"Wenn dies auf einen Pfad zu einer ausführbaren Python-Datei gesetzt ist, wird die Erweiterung diese zum Starten des Servers und aller Unterprozesse verwenden.","settings.logLevel.debug.description":"Enthält ausführliche Protokollierung, die für Debugzwecke vorgesehen ist.","settings.logLevel.description":"Die Ablaufverfolgungsebene, auf der die Erweiterung protokolliert wird, wird standardmäßig auf \"Error\" festgelegt.","settings.logLevel.error.description":"Nur Fehler und immer protokollierte Informationen.","settings.logLevel.info.description":"Schließt alle Nachrichten ein, die nicht als „ausführlich“ oder „debuggen“ gekennzeichnet sind.","settings.logLevel.off.description":"Die meisten Protokollierungen sind deaktiviert. Alle Informationen, die immer protokolliert werden, werden möglicherweise weiterhin angezeigt.","settings.logLevel.warn.description":"Schließt alle Meldungen in der Fehlerkategorie und alle zusätzlichen Warnungen ein.","settings.path.description":"Wenn die Erweiterung auf einen Pfad zur Binärdatei „flake8“ festgelegt ist, wird diese zum Linten verwendet. HINWEIS: Die Verwendung dieser Option kann das Linten verlangsamen.","settings.severity.description":"Zuordnung vom Schweregrad des Nachrichtentyps „flake8“ zum im Problemfenster angezeigten Schweregrad.","settings.showNotifications.always.description":"Benachrichtigungen werden für alles angezeigt, was der Server anzeigen will.","settings.showNotifications.description":"Steuert, wann Benachrichtigungen von dieser Erweiterung angezeigt werden.","settings.showNotifications.off.description":"Alle Benachrichtigungen sind deaktiviert, alle Fehler oder Warnungen sind weiterhin in den Protokollen verfügbar.","settings.showNotifications.onError.description":"Benachrichtigungen werden nur im Falle eines Fehlers angezeigt.","settings.showNotifications.onWarning.description":"Benachrichtigungen werden für Fehler und Warnungen angezeigt."}
